In [15]:
import pandas as pd

In [16]:
asian = pd.read_csv('Resources/asian.csv')
black = pd.read_csv('Resources/black.csv')
white = pd.read_csv('Resources/black.csv')

In [17]:
#combine the race based dataframes to ensure merge is working
race = asian.merge(black, on='DATE').merge(white, on='DATE')

In [18]:
race.head()

       DATE  ASIAN  BLACK_x  BLACK_y
0  1/1/2003    5.5     10.5     10.5
1  2/1/2003    5.8     10.7     10.7
2  3/1/2003    6.5     10.3     10.3
3  4/1/2003    6.0     10.9     10.9
4  5/1/2003    5.5     10.9     10.9

In [19]:
#read the gender dfs in
men = pd.read_csv('Resources/men_rate.csv')
women = pd.read_csv('Resources/women_rate.csv')

In [20]:
#combine the gender dfs into one dataframe for easy viewing
gender_df = men.merge(women, how='outer', on='DATE')
gender_df.head()

       DATE  MEN  WOMEN
0  1/1/2000  3.9    4.1
1  2/1/2000  4.1    4.1
2  3/1/2000  3.8    4.3
3  4/1/2000  3.7    4.0
4  5/1/2000  3.9    4.2

In [21]:
#read in the education csv files for unemployment
highschool = pd.read_csv('Resources/highschool.csv')
bachelors = pd.read_csv('Resources/bachelors.csv')
masters = pd.read_csv('Resources/masters.csv')
doctorate = pd.read_csv('Resources/doctorals.csv')

In [22]:
#combine all three dataframes for database purpose
education = highschool.merge(bachelors,on='DATE').merge(masters,on='DATE').merge(doctorate,on='DATE')
education.head()

       DATE  HIGH SCHOOL  BACHELORS  MASTERS  DOCTORAL
0  1/1/2000          3.4        1.8      1.6       1.4
1  2/1/2000          3.4        1.6      1.6       1.4
2  3/1/2000          3.3        1.7      1.7       0.9
3  4/1/2000          3.3        1.5      1.2       0.6
4  5/1/2000          3.4        1.6      1.0       0.8